IDEA StatiCa Open Model
TendonBar Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon bar
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.TendonBar
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TendonBar : OpenObject
Public Class TendonBar
	Inherits OpenObject
public ref class TendonBar : public OpenObject
The TendonBar type exposes the following members.
Constructors
Name | Description
TendonBar
Initializes a new instance of the TendonBar class
Top
Properties
Name | Description
Id
 Tendon Id
Material
 Material
NumStrandsInTendon
 number of ropes in tendon
Phase
 Phase
Point
 Position of bar
PrestressingOrder
 order of tendon prestessing
PrestressReinforcementType
 set of prestress reinforcement type
TendonDuct
 Tendon duct
TendonType
 Tendon type
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace